In [4]:
import app.scripts.importer

# importer.load_data('\\real\\konto.csv')
importer.load_data('\\account.csv')

# importer.load_pl_millenium('\\test_pl_millenium.csv')

,Bank,Date,Title,Details,Category,Comment,Operation,Currency,Balance
0,Bank A,2021-01-31,Init money,NaN,NaN,init,888.48,PLN,888.48
1,Bank A,2021-02-01,Italian restaurant,NaN,NaN,anniversary,-38.26,PLN,850.22
2,Bank A,2021-02-02,Market A,NaN,NaN,NaN,-14.72,PLN,835.50
3,Bank A,2021-02-03,Netflix,NaN,NaN,NaN,-100.00,PLN,735.50
4,Bank A,2021-02-04,Canteen,NaN,NaN,NaN,-16.20,PLN,719.30
5,Bank A,2021-02-28,Salary,NaN,NaN,January salary,1000.56,PLN,1719.86

In [3]:
df = importer.load_data('\\test_pl_millenium.csv')
df = df[['Data transakcji', 'Opis', 'Obciążenia', 'Uznania', 'Waluta']]
df

  Data transakcji              Opis  Obciążenia  Uznania Waluta
0      2021-03-15  Train ticket PKP      -21.78      NaN    PLN
1      2021-03-08           Spotify      -19.99      NaN    PLN
2      2021-02-26           Przelew         NaN    50.00    PLN
3      2021-02-26            PENSJA         NaN  1234.78    PLN
4      2021-02-25  Zamówienie pizzy      -64.90      NaN    PLN
5      2021-02-22           Telefon      -69.00      NaN    PLN

In [4]:
import numpy as np
df['Operation'] = np.where(df['Obciążenia'] < 0, df['Obciążenia'], df['Uznania'])
df

  Data transakcji              Opis  Obciążenia  Uznania Waluta  Operation
0      2021-03-15  Train ticket PKP      -21.78      NaN    PLN     -21.78
1      2021-03-08           Spotify      -19.99      NaN    PLN     -19.99
2      2021-02-26           Przelew         NaN    50.00    PLN      50.00
3      2021-02-26            PENSJA         NaN  1234.78    PLN    1234.78
4      2021-02-25  Zamówienie pizzy      -64.90      NaN    PLN     -64.90
5      2021-02-22           Telefon      -69.00      NaN    PLN     -69.00

In [5]:
df = df.drop(columns=['Obciążenia', 'Uznania'])
df = df.rename(columns={'Data transakcji': 'Date', 'Opis': 'Title', 'Waluta': 'Currency'})
df['Bank'] = 'Millenium'
existing_columns = list(df.columns)
columns = ['Category', 'Comment']
df.reindex(existing_columns + columns, axis="columns")
df

         Date             Title Currency  Operation       Bank
0  2021-03-15  Train ticket PKP      PLN     -21.78  Millenium
1  2021-03-08           Spotify      PLN     -19.99  Millenium
2  2021-02-26           Przelew      PLN      50.00  Millenium
3  2021-02-26            PENSJA      PLN    1234.78  Millenium
4  2021-02-25  Zamówienie pizzy      PLN     -64.90  Millenium
5  2021-02-22           Telefon      PLN     -69.00  Millenium

In [3]:
import scripts.main.importer as importer

df = importer.load_data('account')
df['Account'] = ['eKonto' if bank == 'Mbank' else '360' for bank in df['Bank']]
df['Active'] = True

df

,Unnamed: 0,Bank,Date,Title,Category,Comment,Operation,Currency,Balance,Account,Active
0,0,Mbank,2018-05-01,init,NaN,stan na początku miesiąca,957.48,PLN,957.48,eKonto,True
1,1,Mbank,2018-05-02,Jedzenie: Dom,NaN,NaN,-38.26,PLN,919.22,eKonto,True
2,2,Mbank,2018-05-02,Jedzenie: Praca,NaN,NaN,-14.20,PLN,905.02,eKonto,True
3,3,Mbank,2018-05-04,Relaks,NaN,paypal,-100.00,PLN,805.02,eKonto,True
4,4,Mbank,2018-05-04,Jedzenie: Praca,NaN,NaN,-16.20,PLN,788.82,eKonto,True
...,...,...,...,...,...,...,...,...,...,...,...
1237,1237,Millenium,2021-03-18,Głupie rozliczenia,NaN,NaN,-2000.00,PLN,7337.71,360,True
1238,1238,Millenium,2021-03-16,720097818469641 KRZYWIEC WOJCIECH odbiorca: I...,NaN,NaN,-420.00,PLN,6917.71,360,True
1239,1239,Millenium,2021-03-15,P24-Y17-Q22-J37 Oplata Salda / 11822009 PayPro...,NaN,NaN,-17.99,PLN,6899.72,360,True
1240,1240,Millenium,2021-03-15,AUT BILET 2485620 WARSZAWA WARSZAWA P...,NaN,NaN,-8.80,PLN,6890.92,360,True
1241,1241,Millenium,2021-03-08,Spotify P13C3933F0 Stockholm Stockhol ...,NaN,NaN,-19.99,PLN,6870.93,360,True

In [6]:
import numpy as np

df['Details'] = np.NaN
df = df[['Bank', 'Account', 'Active', 'Date', 'Title', 'Details', 'Category', 'Comment', 'Operation', 'Currency', 'Balance']]
df

,Bank,Account,Active,Date,Title,Details,Category,Comment,Operation,Currency,Balance
0,Mbank,eKonto,True,2018-05-01,init,NaN,NaN,stan na początku miesiąca,957.48,PLN,957.48
1,Mbank,eKonto,True,2018-05-02,Jedzenie: Dom,NaN,NaN,NaN,-38.26,PLN,919.22
2,Mbank,eKonto,True,2018-05-02,Jedzenie: Praca,NaN,NaN,NaN,-14.20,PLN,905.02
3,Mbank,eKonto,True,2018-05-04,Relaks,NaN,NaN,paypal,-100.00,PLN,805.02
4,Mbank,eKonto,True,2018-05-04,Jedzenie: Praca,NaN,NaN,NaN,-16.20,PLN,788.82
...,...,...,...,...,...,...,...,...,...,...,...
1237,Millenium,360,True,2021-03-18,Głupie rozliczenia,NaN,NaN,NaN,-2000.00,PLN,7337.71
1238,Millenium,360,True,2021-03-16,720097818469641 KRZYWIEC WOJCIECH odbiorca: I...,NaN,NaN,NaN,-420.00,PLN,6917.71
1239,Millenium,360,True,2021-03-15,P24-Y17-Q22-J37 Oplata Salda / 11822009 PayPro...,NaN,NaN,NaN,-17.99,PLN,6899.72
1240,Millenium,360,True,2021-03-15,AUT BILET 2485620 WARSZAWA WARSZAWA P...,NaN,NaN,NaN,-8.80,PLN,6890.92
1241,Millenium,360,True,2021-03-08,Spotify P13C3933F0 Stockholm Stockhol ...,NaN,NaN,NaN,-19.99,PLN,6870.93

In [7]:
import scripts.main.config as config

df.to_csv(config.mankoo_account_path())